languages/scala.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-19 Mon 02:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computer Science 3MI3 – Scala tidbits</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="Examples and code tidbits which help us understand Scala
and functional programming in general."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Computer Science 3MI3 – Scala tidbits</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Example-of-~Option[Either[A,B]]~-recursive-functions">Example of <code>Option[Either[A,B]]</code> recursive functions</a></li>
</ul>
</div>
</div>

<div id="outline-container-Example-of-~Option[Either[A,B]]~-recursive-functions" class="outline-2">
<h2 id="Example-of-~Option[Either[A,B]]~-recursive-functions">Example of <code>Option[Either[A,B]]</code> recursive functions</h2>
<div class="outline-text-2" id="text-Example-of-~Option[Either[A,B]]~-recursive-functions">
<p>
In the first assignment, the final interpreter requires
the return type of <code>Option[Either[Int,Boolean]]</code>.
The idea is that <code>Option[Either[Int,Boolean]]</code> contains
</p>
<ul class="org-ul">
<li>the value <code>None</code> which represents failure,</li>
<li>for each integer <code>n</code>, the value <code>Some(Left(n))</code>,</li>
<li>for each boolean <code>b</code>, the value <code>Some(Right(b))</code></li>
</ul>
<p>
so this return type can be used for an interpreter
which might return an integer, might return a boolean, or
might fail.
</p>

<p>
This type can be somewhat awkward to work with,
at least until we discuss the concept of <i>combining</i> such values
(also known as <i>monadic bind</i>'s.)
</p>

<p>
For the moment, this example code may help you with
your own definitions for the assignment.
</p>

<p>
Here, we work with that same type of <code>Option[Either[Int,Boolean]]</code> to
define <code>sum</code> and <code>product</code> methods, with the idea that
</p>
<ul class="org-ul">
<li>the <code>sum</code> of two integers is their sum in the usual sense,</li>
<li>the <code>sum</code> of two booleans is the result of “logically or-ing” them,</li>
<li>and the <code>sum</code> of two values of different types is undefined.</li>
</ul>
<p>
The <code>product</code> is similar, but uses logical and for the boolean case.
</p>

<p>
The important takeaway here is how we (using pattern matching)
</p>
<ol class="org-ol">
<li>“unwrap” the argument values <code>x</code> and <code>y</code>,</li>
<li>then in the cases we have two integers or two booleans,
perform the relevant operation before</li>
<li>“rewrap”-ing the result; and</li>
<li><p>
for the other cases,
</p>
<ul class="org-ul">
<li>(having a <code>None</code> for one or both of the arguments,</li>
<li>or having an integer for one argument and a boolean for the other)</li>
</ul>
<p>
which we summarise with the “catch-all” case using underscores,
we return <code>None</code>, representing failure.
</p></li>
</ol>
<div class="org-src-container">
<pre class="src src-amm"><span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">sum</span><span style="color: #00cd68;">(</span>x<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Option</span><span style="color: #b6a0ff;">[</span><span style="color: #00bcff;">Either</span><span style="color: #6ae4b9;">[</span><span style="color: #00bcff;">Int</span>,<span style="color: #00bcff;">Boolean</span><span style="color: #6ae4b9;">]</span><span style="color: #b6a0ff;">]</span>,
        y<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Option</span><span style="color: #b6a0ff;">[</span><span style="color: #00bcff;">Either</span><span style="color: #6ae4b9;">[</span><span style="color: #00bcff;">Int</span>,<span style="color: #00bcff;">Boolean</span><span style="color: #6ae4b9;">]</span><span style="color: #b6a0ff;">]</span><span style="color: #00cd68;">)</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Option</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">Either</span><span style="color: #b6a0ff;">[</span><span style="color: #00bcff;">Int</span>,<span style="color: #00bcff;">Boolean</span><span style="color: #b6a0ff;">]</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">=</span>
  <span style="color: #00cd68;">(</span>x, y<span style="color: #00cd68;">)</span> <span style="color: #b6a0ff;">match</span> <span style="color: #00cd68;">{</span>
    <span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7;">Some</span><span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">Left</span><span style="color: #f0ce43;">(</span><span style="color: #00d3d0;">m</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span>, <span style="color: #f78fe7;">Some</span><span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">Left</span><span style="color: #f0ce43;">(</span><span style="color: #00d3d0;">n</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Some</span><span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">Left</span><span style="color: #6ae4b9;">(</span>m + n<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
    <span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7;">Some</span><span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">Right</span><span style="color: #f0ce43;">(</span><span style="color: #00d3d0;">a</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span>, <span style="color: #f78fe7;">Some</span><span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">Right</span><span style="color: #f0ce43;">(</span><span style="color: #00d3d0;">b</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Some</span><span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">Right</span><span style="color: #6ae4b9;">(</span>a || b<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
    <span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">_</span> , <span style="color: #b6a0ff;">_</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">None</span>
  <span style="color: #00cd68;">}</span>

<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">product</span><span style="color: #00cd68;">(</span>x<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Option</span><span style="color: #b6a0ff;">[</span><span style="color: #00bcff;">Either</span><span style="color: #6ae4b9;">[</span><span style="color: #00bcff;">Int</span>,<span style="color: #00bcff;">Boolean</span><span style="color: #6ae4b9;">]</span><span style="color: #b6a0ff;">]</span>,
            y<span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Option</span><span style="color: #b6a0ff;">[</span><span style="color: #00bcff;">Either</span><span style="color: #6ae4b9;">[</span><span style="color: #00bcff;">Int</span>,<span style="color: #00bcff;">Boolean</span><span style="color: #6ae4b9;">]</span><span style="color: #b6a0ff;">]</span><span style="color: #00cd68;">)</span><span style="color: #b6a0ff;">:</span> <span style="color: #f78fe7;">Option</span><span style="color: #00cd68;">[</span><span style="color: #00bcff;">Either</span><span style="color: #b6a0ff;">[</span><span style="color: #00bcff;">Int</span>,<span style="color: #00bcff;">Boolean</span><span style="color: #b6a0ff;">]</span><span style="color: #00cd68;">]</span> <span style="color: #b6a0ff;">=</span>
  <span style="color: #00cd68;">(</span>x, y<span style="color: #00cd68;">)</span> <span style="color: #b6a0ff;">match</span> <span style="color: #00cd68;">{</span>
    <span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7;">Some</span><span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">Left</span><span style="color: #f0ce43;">(</span><span style="color: #00d3d0;">m</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span>, <span style="color: #f78fe7;">Some</span><span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">Left</span><span style="color: #f0ce43;">(</span><span style="color: #00d3d0;">n</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Some</span><span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">Left</span><span style="color: #6ae4b9;">(</span>m * n<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
    <span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">(</span><span style="color: #f78fe7;">Some</span><span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">Right</span><span style="color: #f0ce43;">(</span><span style="color: #00d3d0;">a</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span>, <span style="color: #f78fe7;">Some</span><span style="color: #6ae4b9;">(</span><span style="color: #f78fe7;">Right</span><span style="color: #f0ce43;">(</span><span style="color: #00d3d0;">b</span><span style="color: #f0ce43;">)</span><span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">Some</span><span style="color: #b6a0ff;">(</span><span style="color: #00bcff;">Right</span><span style="color: #6ae4b9;">(</span>a &amp;&amp; b<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span>
    <span style="color: #b6a0ff;">case</span> <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">_</span> , <span style="color: #b6a0ff;">_</span><span style="color: #b6a0ff;">)</span> <span style="color: #b6a0ff;">=&gt;</span> <span style="color: #00bcff;">None</span>
  <span style="color: #00cd68;">}</span>
</pre>
</div>

<p>
You may have noticed the extreme similarity between these two methods.
And indeed, you may see similarity between these methods
and the code you may write for the assignment.
</p>

<p>
If you are considering how we can <i>generalise</i> these
operations in order to avoid repeating ourselves as I have above
(having rewritten or copied/pasted the pattern matching,
changing on the first two righthand sides)
stay tuned; as mentioned earlier, we will discuss these concepts
later on in the course.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: October 19th, 2020</p>
     <p class="date">Last updated: 2020-10-19 Mon 02:03</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.91 (<a href="https://orgmode.org">Org</a> mode 9.4)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
